# создаём словарь с единицами
units = { 0: "ноль", 1: "один", 2: "два", 3: "три", 4: "четыре", 5:"пять",
          6: "шесть", 7: "семь", 8: "восемь", 9: "девять", 10: "десять",
          11: "одинадцать", 12: "двенадцать", 13: "тринадцать",
          14: "четырнадцать", 15: "пятнадцать", 16: "шестнадцать",
          17: "семнадцать", 18: "восемнадцать", 19: "девятнадцать" }
# создаём словарь с десятками
tens = { 2: "двадцать", 3: "тридцать", 4: "сорок", 5: "пятьдесят",
         6: "шестьдесят", 7: "семьдесят", 8: "весемьдесят", 9: "девяносто" }
          
#ббесконечный цикл
while True:
    # запрашиваем ввод числа
    inpt = input("Введите целое число от 0 до 99: ")
    # переводим строку в число
    number = int(inpt)

    # проверяем корректность заданого числа
    if number < 0 or number > 99:
        print("число должно быть от 0 до 99, попробуйте снова")
        continue #возвращает в начало программы
    else:
            # задаём диапазон для единиц
            if number < 20:
                print(units[number])
            # задаём диапазон для круглых десятков
            elif number % 10 == 0:
                print(tens[number//10])
            # теперь составные числа
            else:
                tens_part = tens[number//10]
                units_part = units[number%10]
                print(f"{tens_part} {units_part}")

    break #разрываем цикл
